Samples:10000; Epochs:100
Runtime: 255.14994740486145 seconds
Energy median: -0.34732087966183167
X Momentum median: -0.048095077188196646
Y Momentum median: -0.33002404219961046
First array expected, second array predicted:
E[ 55.12962998 594.16806271 104.81912192];[ 35.34209743 499.47540996  56.99022124];
px[ -8.61240544 -63.48377172 -16.73771089];[ -6.5861855 -58.369232  -14.737044 ];
py[-23.11247526 -70.34859372  -7.67319354];[-23.981853  -73.669876   -2.2272928];

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6)                 42        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 72)                504       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 72)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 72)                5256      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 72)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 72)                5256      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 72)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 72)                5256      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 72)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 72)                5256      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 72)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 6)                 438       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 6)                 0         
=================================================================
Total params: 22,008
Trainable params: 22,008
Non-trainable params: 0
_________________________________________________________________
