Samples:10000; Epochs:400
Runtime: 861.9424529075623 seconds
Energy median: -0.02305268486467443
X Momentum median: -0.0157129786512978
Y Momentum median: -0.006644422792188898
First array expected, second array predicted:
E[ 16.50804551 123.07237508  20.16473886];[ 12.54433034 127.76721701  19.69508235];
px[ -4.73189305 -29.9494634   -4.59365185];[ -3.24509073 -30.50290611  -4.88715618];
py[-3.44264282 -2.45107993 -9.55035159];[-3.91214608 -2.66174656 -9.63931548];
Percentage within 10% of true value for all conserved quantities: 31.89%

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6)                 42        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 48)                336       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 196       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 4)                 0         
=================================================================
Total params: 9,982
Trainable params: 9,982
Non-trainable params: 0
_________________________________________________________________
loss: 0.6822 - mean_absolute_percentage_error: 42.6240 - val_loss: 0.7239 - val_mean_absolute_percentage_error: 60.6765