loss: 10907.8776 - mean_absolute_percentage_error: 607.3041 - val_loss: 10824.5357 - val_mean_absolute_percentage_error: 1853.6541

Samples:10000; Epochs:100
Runtime: 246.46910762786865 seconds
Energy median: 0.0
X Momentum median: 0.0
Y Momentum median: 0.0
First array expected, second array predicted:
E[12.66708362 27.07657223  4.47814547];[16.22354688 20.8013792  29.66777403];
px[-3.69903097 -6.37291283  1.10425182];[-3.50214288 -3.9885181  -6.71661419];
py[-2.1445834  -0.40453427 -3.529767  ];[-3.33916354 -3.92668664 -6.74597531];
Percentage within 10% of true value for all conserved quantities: 0.73%


Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 9)                 54        
_________________________________________________________________
dense_1 (Dense)              (None, 9)                 90        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 9)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 9)                 90        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 9)                 0         
_________________________________________________________________
dense_3 (Dense)              (None, 9)                 90        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 9)                 0         
_________________________________________________________________
dense_4 (Dense)              (None, 9)                 90        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 9)                 0         
_________________________________________________________________
dense_5 (Dense)              (None, 9)                 90        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 9)                 0         
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 40        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 4)                 0         
=================================================================
Total params: 544