Samples:10000; Epochs:1000
Runtime: 2048.8168592453003 seconds
Energy median: -0.05044717453891963
X Momentum median: -0.012841898692044471
Y Momentum median: -0.03606093216819678
First array expected, second array predicted:
E[ 55.12962998 594.16806271 104.81912192];[ 39.55546876 519.45079552 103.35662478];
px[ -8.61240544 -63.48377172 -16.73771089];[ -6.7683673 -63.004944  -16.631939 ];
py[-23.11247526 -70.34859372  -7.67319354];[-18.883165 -60.70204   -9.611293];

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6)                 42        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 48)                336       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 294       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 6)                 0         
=================================================================
Total params: 5,376
Trainable params: 5,376
Non-trainable params: 0