Samples:10000; Epochs:100
Runtime: 216.44650435447693 seconds
Energy median: -0.2519234735732889
X Momentum median: -0.34186917599329536
Y Momentum median: -0.0737346894963842
First array expected, second array predicted:
E[ 55.12962998 594.16806271 104.81912192];[ 21.06390233 387.42213708  18.24418231];
px[ -8.61240544 -63.48377172 -16.73771089];[ -1.0241209 -48.882072   -5.8661795];
py[-23.11247526 -70.34859372  -7.67319354];[-14.467161 -54.110474  -5.120535];

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6)                 42        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 48)                336       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 294       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 6)                 0         
=================================================================
Total params: 5,376
Trainable params: 5,376
Non-trainable params: 0