loss: 0.6320 - accuracy: 0.6330 - val_loss: 0.6411 - val_accuracy: 0.6148

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 27)                270       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 27)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 27)                756       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 27)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 28        
=================================================================
Total params: 1,054
Trainable params: 1,054
Non-trainable params: 0
_________________________________________________________________
CONFUSION:
   1	0  True Value
1(1128, 1156)
0(2696, 5020)
Pred
Value