Samples:10000; Epochs:1000
Runtime: 2252.6358177661896 seconds
Energy median: -0.010058504862178345
X Momentum median: 0.016855454411211918
Y Momentum median: 0.003380627212778005
First array expected, second array predicted:
E[ 55.12962998 594.16806271 104.81912192];[ 44.54861933 460.47399842 123.94967527];
px[ -8.61240544 -63.48377172 -16.73771089];[ -7.0763736 -63.833908  -19.286188 ];
py[-23.11247526 -70.34859372  -7.67319354];[-20.539679 -50.900337 -10.358507];

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 6)                 42        
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 6)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 48)                336       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 48)                2352      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 48)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 6)                 294       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 6)                 0         
=================================================================
Total params: 10,080
Trainable params: 10,080
Non-trainable params: 0