loss: 0.3800 - accuracy: 0.9232 - val_loss: 0.3824 - val_accuracy: 0.9287

mean_absolute_error

loss: 0.3800 - accuracy: 0.8739 - val_loss: 0.3824 - val_accuracy: 0.8858



(441, 701)
(3383, 5475)

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 27)                270       
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 27)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 27)                756       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 27)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 56        
=================================================================
Total params: 1,082